In [2]:
"hello python".upper()

'HELLO PYTHON'

In [3]:
import pandas as pd
import numpy as np

data =["tIm","KAtE","SUsAn",np.nan,"aLEx"]

name= pd.Series(data)

name

0      tIm
1     KAtE
2    SUsAn
3      NaN
4     aLEx
dtype: object

In [4]:
name.str.capitalize() # capatilise the name

0      Tim
1     Kate
2    Susan
3      NaN
4     Alex
dtype: object

In [5]:
name.str.upper() # upper the name

0      TIM
1     KATE
2    SUSAN
3      NaN
4     ALEX
dtype: object

In [6]:
name.str.lower() # lower the name

0      tim
1     kate
2    susan
3      NaN
4     alex
dtype: object

In [7]:
name.str.len() # len of the name

0    3.0
1    4.0
2    5.0
3    NaN
4    4.0
dtype: float64

In [8]:
name.str.startswith("t") # find the name which start with 't'

0     True
1    False
2    False
3      NaN
4    False
dtype: object

In [9]:
df = pd.DataFrame(np.random.randn(3,2),columns=["Column A","Column B"],index=range(3))

df

   Column A  Column B
0 -1.614378 -1.546902
1  0.165617  0.532650
2 -1.062160 -1.084821

In [10]:
df.columns

Index(['Column A', 'Column B'], dtype='object')

In [11]:
df.columns.str.lower().str.replace(" ","_") # change into lowercase and replace it with "_"

Index(['column_a', 'column_b'], dtype='object')

In [13]:
s= pd.Series(["a_b_c","c_d_e",np.nan,"f_g_h"])

s

0    a_b_c
1    c_d_e
2      NaN
3    f_g_h
dtype: object

In [16]:
s.str.split("_").str[2] # split the data by "_"(underscore)

0      c
1      e
2    NaN
3      h
dtype: object

In [18]:
s.str.split("_",expand=True,n=2) # change the split value into dataframe

     0    1    2
0    a    b    c
1    c    d    e
2  NaN  NaN  NaN
3    f    g    h

In [20]:
# working with regular expressions

money = pd.Series(["150","-$30","$70000"])
money

0       150
1      -$30
2    $70000
dtype: object

In [22]:
money.str.replace("-\$"," ")

<ipython-input-22-a9122f4977f2>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  money.str.replace("-\$"," ")

0       150
1        30
2    $70000
dtype: object

In [23]:
money.str.replace("-\$","-")

<ipython-input-23-3ebe628f7c6e>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  money.str.replace("-\$","-")

0       150
1       -30
2    $70000
dtype: object

In [29]:
film = pd.read_csv("data/imbd.csv") # the dataset of movies 


film

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,0.00,45
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,0.00,22
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11

In [26]:
film.head()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40

In [30]:
film.Title.str.upper()

0      GUARDIANS OF THE GALAXY
1                   PROMETHEUS
2                        SPLIT
3                         SING
4                SUICIDE SQUAD
                ...
995       SECRET IN THEIR EYES
996            HOSTEL: PART II
997     STEP UP 2: THE STREETS
998               SEARCH PARTY
999                 NINE LIVES
Name: Title, Length: 1000, dtype: object

In [34]:
films_columns = film.columns.str.upper()

In [35]:
films_columns

Index(['RANK', 'TITLE', 'GENRE', 'DESCRIPTION', 'DIRECTOR', 'ACTORS', 'YEAR',
       'RUNTIME (MINUTES)', 'RATING', 'VOTES', 'REVENUE (MILLIONS)',
       'METASCORE'],
      dtype='object')

In [33]:
film

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,0.00,45
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,0.00,22
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11

In [36]:
film[film.Actors.str.contains('Brad Pitt')]

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
71,72,Allied,"Action,Drama,Romance","In 1942, a Canadian intelligence officer in No...",Robert Zemeckis,"Brad Pitt, Marion Cotillard, Jared Harris, Vin...",2016,124,7.1,78079,40.07,60
77,78,Inglourious Basterds,"Adventure,Drama,War","In Nazi-occupied France during World War II, a...",Quentin Tarantino,"Brad Pitt, Diane Kruger, Eli Roth,Mélanie Laurent",2009,153,8.3,959065,120.52,69
111,112,12 Years a Slave,"Biography,Drama,History","In the antebellum United States, Solomon North...",Steve McQueen,"Chiwetel Ejiofor, Michael Kenneth Williams, Mi...",2013,134,8.1,486338,56.67,96
142,143,The Big Short,"Biography,Comedy,Drama",Four denizens in the world of high-finance pre...,Adam McKay,"Christian Bale, Steve Carell, Ryan Gosling, Br...",2015,130,7.8,246360,70.24,81
240,241,Fury,"Action,Drama,War",A grizzled tank commander makes tough decision...,David Ayer,"Brad Pitt, Shia LaBeouf, Logan Lerman, Michael...",2014,134,7.6,332234,85.71,64
425,426,The Curious Case of Benjamin Button,"Drama,Fantasy,Romance","Tells the story of Benjamin Button, a man who ...",David Fincher,"Brad Pitt, Cate Blanchett, Tilda Swinton, Juli...",2008,166,7.8,485075,127.49,70
432,433,World War Z,"Action,Adventure,Horror",Former United Nations employee Gerry Lane trav...,Marc Forster,"Brad Pitt, Mireille Enos, Daniella Kertesz, Ja...",2013,116,7.0,494819,202.35,63
584,585,Moneyball,"Biography,Drama,Sport",Oakland A's general manager Billy Beane's succ...,Bennett Miller,"Brad Pitt, Robin Wright, Jonah Hill, Philip Se...",2011,133,7.6,297395,75.61,87
599,600,Megamind,"Animation,Action,Comedy",The supervillain Megamind finally defeats his ...,Tom McGrath,"Will Ferrell, Jonah Hill, Brad Pitt, Tina Fey",2010,95,7.3,183926,148.34,63
613,614,The Assassination of Jesse James by the Coward...,"Biography,Crime,Drama","Robert Ford, who's idolized Jesse James since ...",Andrew Dominik,"Brad Pitt, Casey Affleck, Sam Shepard, Mary-Lo...",2007,160,7.5,143564,3.90,68
885,886,Babel,Drama,Tragedy strikes a married couple on vacation i...,Alejandro González Iñárritu,"Brad Pitt, Cate Blanchett, Gael García Bernal,...",2006,143,7.5,253417,34.30,69
886,887,The Tree of Life,"Drama,Fantasy","The story of a family in Waco, Texas in 1956. ...",Terrence Malick,"Brad Pitt, Sean Penn, Jessica Chastain, Hunter...",2011,139,6.8,143517,13.30,85
907,908,Ocean's Thirteen,"Crime,Thriller",Danny Ocean rounds up the boys for a third hei...,Steven Soderbergh,"George Clooney, Brad Pitt, Matt Damon,Michael ...",2007,122,6.9,269581,117.14,62

In [37]:
film.shape # the shape of the data

(1000, 12)

In [39]:
film.info() # get the information of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  1000 non-null   float64
 11  Metascore           1000 non-null   int64
dtypes: float64(2), int64(5), object(5)
memory usage: 93.9+ KB

In [40]:
film.mean()

<ipython-input-40-24ed291711b4>:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  film.mean()

Rank                     500.50000
Year                    2012.78300
Runtime (Minutes)        113.17200
Rating                     6.72320
Votes                 169808.25500
Revenue (Millions)        72.33796
Metascore                 58.84300
dtype: float64

In [41]:
film.max()

Rank                                                               1000
Title                                              the devil's mistress
Genre                                                      Thriller,War
Description           Young, up-and-coming martial artist, Bruce Lee...
Director                                                  Zackary Adler
Actors                Zooey Deschanel, Joseph Gordon-Levitt, Geoffre...
Year                                                               2016
Runtime (Minutes)                                                   191
Rating                                                              9.0
Votes                                                           1791916
Revenue (Millions)                                               936.63
Metascore                                                           100
dtype: object

In [42]:
film.min()

Rank                                                                  1
Title                                              (500) Days of Summer
Genre                                                            Action
Description           "21" is the fact-based story about six MIT stu...
Director                                                     Aamir Khan
Actors                Aamir Khan, Anushka Sharma, Sanjay Dutt,Boman ...
Year                                                               2006
Runtime (Minutes)                                                    66
Rating                                                              1.9
Votes                                                                61
Revenue (Millions)                                                  0.0
Metascore                                                            11
dtype: object

In [45]:
film.Description.describe()

count                                                  1000
unique                                                 1000
top       A group of intergalactic criminals are forced ...
freq                                                      1
Name: Description, dtype: object

In [46]:
film.Rating.unique()

array([8.1, 7. , 7.3, 7.2, 6.2, 6.1, 8.3, 6.4, 7.1, 7.5, 7.8, 7.9, 7.7,
       6.6, 8.2, 6.7, 8. , 6.5, 5.3, 6.8, 4.7, 5.9, 6.3, 5.6, 8.6, 7.6,
       6.9, 2.7, 3.7, 5.8, 9. , 7.4, 4.1, 8.5, 8.8, 5.4, 6. , 5.7, 8.4,
       5.2, 5.5, 4.8, 3.9, 4.9, 5.1, 5. , 4.3, 4.6, 4.2, 4. , 3.2, 4.5,
       1.9, 3.5, 4.4])

In [48]:
film_rating_mean = film.Rating.mean()

film.Rating.map(lambda p:p-film_rating_mean)

0      1.3768
1      0.2768
2      0.5768
3      0.4768
4     -0.5232
        ...
995   -0.5232
996   -1.2232
997   -0.5232
998   -1.1232
999   -1.4232
Name: Rating, Length: 1000, dtype: float64

In [49]:
film.Rating - film_rating_mean

0      1.3768
1      0.2768
2      0.5768
3      0.4768
4     -0.5232
        ...
995   -0.5232
996   -1.2232
997   -0.5232
998   -1.1232
999   -1.4232
Name: Rating, Length: 1000, dtype: float64

In [51]:
film.groupby('Rating').Rating.count()

Rating
1.9     1
2.7     2
3.2     1
3.5     2
3.7     2
3.9     3
4.0     1
4.1     1
4.2     2
4.3     4
4.4     1
4.5     1
4.6     5
4.7     6
4.8     4
4.9     7
5.0     4
5.1     5
5.2    11
5.3    12
5.4    12
5.5    14
5.6    17
5.7    21
5.8    26
5.9    19
6.0    26
6.1    31
6.2    37
6.3    44
6.4    35
6.5    40
6.6    42
6.7    48
6.8    37
6.9    31
7.0    46
7.1    52
7.2    42
7.3    42
7.4    33
7.5    35
7.6    27
7.7    27
7.8    40
7.9    23
8.0    19
8.1    26
8.2    10
8.3     7
8.4     4
8.5     6
8.6     3
8.8     2
9.0     1
Name: Rating, dtype: int64

In [57]:
film.groupby('Year').Rating.max()

Year
2006    8.5
2007    8.5
2008    9.0
2009    8.4
2010    8.8
2011    8.6
2012    8.5
2013    8.2
2014    8.6
2015    8.3
2016    8.8
Name: Rating, dtype: float64

In [56]:
film.groupby('Year').Rating.min()

Year
2006    5.6
2007    4.7
2008    1.9
2009    2.7
2010    4.2
2011    4.9
2012    5.3
2013    4.3
2014    5.1
2015    3.5
2016    2.7
Name: Rating, dtype: float64

In [55]:
film.groupby(['Year']).Rating.agg([len,max,min])

      len  max  min
Year
2006   44  8.5  5.6
2007   53  8.5  4.7
2008   52  9.0  1.9
2009   51  8.4  2.7
2010   60  8.8  4.2
2011   63  8.6  4.9
2012   64  8.5  5.3
2013   91  8.2  4.3
2014   98  8.6  5.1
2015  127  8.3  3.5
2016  297  8.8  2.7

In [58]:
film_reviews = film.groupby(['Year','Title']).Rating.agg([len])

In [59]:
film_reviews

                           len
Year Title
2006 300                     1
     A Good Year             1
     Apocalypto              1
     Babel                   1
     Blood Diamond           1
...                        ...
2016 X-Men: Apocalypse       1
     Yoga Hosers             1
     Zoolander 2             1
     Zootopia                1
     the devil's mistress    1

[1000 rows x 1 columns]